app/controllers/avatars_controller.rb

  def create
    @avatar = @location.avatars.build(params[:avatar])
    if @avatar.save
---
INSERT INTO `avatars` (`photo_file_size`, `created_at`, `photo_file_name`, `updated_at`, `photo_content_type`, `caption`, `photo_updated_at`, `location_id`) VALUES(7388, '2011-06-03 23:04:56', 'IT1.jpg', '2011-06-03 23:04:56', 'image/jpeg', 'caption', '2011-06-03 23:04:55', NULL)

  def edit
    @avatar = @location.avatars.find_by_id(params[:id])
---
SELECT * FROM `avatars` WHERE (`avatars`.`id` = '3') AND (`avatars`.location_id = 2) LIMIT 1

  def destroy
    @avatar = Avatar.find_by_id(params[:id])
    if @avatar.destroy
---
SELECT * FROM `avatars` WHERE (`avatars`.`id` = '1') LIMIT 1
DELETE FROM `avatars` WHERE `id` = 1

  def load_location
    @location = Location.find_by_id(params[:location_id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = '3') LIMIT 1