app/controllers/locations_controller.rb

SELECT * FROM `locations`
---
  def search_location

    query = "1=1"
    query = query + " AND ( start_date BETWEEN '#{Date.strptime(params[:request_date], '%m / %d / %y')}' AND '#{Date.strptime(params[:request_date], '%m / %d / %y') + 30.days}' )" unless params[:request_date].blank? or params[:request_date] == "mm / dd / yy"
    query = query + " AND ( city = '#{params[:requested_city]}' OR nearest_metro = '#{params[:requested_city]}' ) " unless params[:requested_city] == "Add My City!"
    query = query + " AND park_store = '#{params[:storage_menus]}'" unless params[:storage_menus] == "Both"
    query = query + " AND location_status = 'Show Listing'"
    query = query + " AND rent_status = 'Available'"
    query = query + " AND quantity > 0 "



    @locations = Location.paginate(:all, :conditions => [query] ,:page => params[:page], :per_page => 3, :order => "price ASC")

SELECT * FROM `features`
---
  def new
    @location = Location.new
    @features = Feature.all

INSERT INTO `features_locations` (`feature_id`, `location_id`) VALUES (1, 1)
INSERT INTO `features` (`name`, `created_at`, `updated_at`) VALUES('Heated', '2011-06-03 22:29:41', '2011-06-03 22:29:41')
INSERT INTO `locations` (`address`, `start_date`, `price`, `region`, `city`, `latitude`, `created_at`, `security`, `country_code`, `storage_type`, `park_store`, `zipcode`, `locatable_type`, `updated_at`, `headline`, `locatable_id`, `rent_status`, `floor`, `county`, `street`, `user_id`, `unit`, `accommodates`, `phone`, `location_status`, `access`, `description`, `longitude`) VALUES('Roanoke Regional Airport (ROA), 5202 Aviation Dr, Roanoke, VA 24012-1143, USA', '2011-06-14', 12.0, 'VA', 'Roanoke', 37.325278, '2011-06-14 12:46:24', 'Building Locks', 'US', 'Attic', 'Storage', '24012-1143', NULL, '2011-06-14 12:46:24', 'Headline', NULL, 'Available', 'Ground', NULL, 'Roanoke Rgnl/Woodrum Field (Roa), 5202 Aviation Dr', 2, NULL, 'A few boxes', '3333333333', NULL, 'Renter requests access', 'Description', -79.975278)
SELECT * FROM `features`
---
  def create
    @location = Location.new(params[:location])
    @location.feature_ids = params[:features]
    @location.location_status = "Show Listing"
    @location.rent_status = "Available"
    if @location.save
      flash[:notice] = "Location saved successfully!"
      redirect_to new_location_avatar_path(@location)
    else
      @map = GMap.new("map")
      @map.control_init(:map_type => true, :small_zoom => true)
      @map.center_zoom_init([37.09, -95.71], 4)
      @features = Feature.all

SELECT * FROM `locations` WHERE (`locations`.`id` = '2') LIMIT 1
SELECT * FROM `features`
---
  def edit
    @location = Location.find_by_id(params[:id])
    @features = Feature.all

SELECT * FROM `locations` WHERE (`locations`.`id` = '1') LIMIT 1
UPDATE `locations` SET `updated_at` = '2011-06-10 00:07:52', `location_status` = NULL WHERE `id` = 1
---
  def update_location_status
    @location = Location.find_by_id(params[:id])
    @location.update_attribute("location_status", params["location_status_#{@location.id}"])

SELECT * FROM `locations` WHERE (`locations`.`id` = '1') LIMIT 1
UPDATE `locations` SET `updated_at` = '2011-06-10 00:56:05', `start_date` = '2011-06-24' WHERE `id` = 1
---
  def update_start_date
    @location = Location.find_by_id(params[:id])
    @location.update_attribute("start_date", params["location_#{@location.id}_start_date"])

SELECT * FROM `locations` WHERE (`locations`.`id` = 2)
UPDATE `locations` SET `updated_at` = '2011-06-15 01:19:56', `latitude` = -1.9381325, `address` = 'CSR, Boulevard de l Umuganda, Kigali, Rwanda', `county` = 'Kigali', `region` = 'Kigali', `street_name` = 'Caisse Sociale Du Rwanda, Boulevard De L\' Umuganda', `street` = 'Caisse Sociale Du Rwanda, Boulevard De L\' Umuganda', `longitude` = 30.0800353, `street_number` = '', `country_code` = 'RW' WHERE `id` = 1
SELECT * FROM `avatars` WHERE (`avatars`.location_id = 2)
SELECT * FROM `features` INNER JOIN `features_locations` ON `features`.id = `features_locations`.feature_id WHERE (`features_locations`.location_id = 2 )
---
  def update
    @location = Location.find(params[:id])
    @location.feature_ids = params[:features]
    if @location.update_attributes(params[:location])
      flash[:notice] = "Location updated successfully!"
      unless @location.avatars.blank?

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def show
    @location = Location.find(params[:id])