app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.roles << Role.find_by_name("User")
    if @user.save
---
INSERT INTO `roles` (`name`, `created_at`, `updated_at`) VALUES('Admin', '2011-06-03 17:42:38', '2011-06-03 17:42:38')
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `username`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `last_name`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `first_name`, `email`, `active`) VALUES('IUWUj8w0DBFsba6Ku0I', NULL, '2011-06-03 17:42:38', 'fc13eb1daea50bf51735ebfa6aa90748d91f793eb14ad1bd2d92ecc6e3291155379681fea105b8e4c08811de827e4023e942e2852df89f142c4a45841708b2a1', '3iXM2ImqoML1WAVkQJjV', '2011-06-03 17:42:38', 'admin', 0, NULL, 'QKLOgOrAclyQsrhcuWY', NULL, NULL, '4f15cbc63476cc93c2f5e2cdfc3cf9adbba589e5609a9c58f835c546ac674c2778d68d7fa1c40e824bce6a2c48ff63cb9647521e3640e29d1aef00f4e0acfcca', 0, NULL, NULL, NULL, 'admin@website.com', 0)
SELECT * FROM `roles` WHERE (`roles`.`name` = 'Admin') LIMIT 1
UPDATE `users` SET `updated_at` = '2011-06-03 17:42:38', `perishable_token` = 'ZuLY1zwaho7j99omu0Y', `active` = 1 WHERE `id` = 1