app/controllers/user_sessions_controller.rb

SELECT * FROM `users` WHERE (LOWER(`users`.email) = 'afasdf') LIMIT 1
---
  def create
    if request.xhr?
      @user_session = UserSession.new(params[:user_session])
      if @user_session.save
        #        flash[:notice] = "Login successful !"
        render :update do |page|
          if session[:return_to]
            page << "window.location='#{session[:return_to]}'"
            session[:return_to] = nil
          else
            user = User.find_by_email(@user_session.email)