app/controllers/welcome_controller.rb

  def index
    flash[:notice] = nil
    unless current_user
      @user_session = UserSession.new
      @user = User.new
    end
    @spaces = Location.all
---
SELECT * FROM `locations`